package Chapter_04_02;

public class If_and_Switch_01 {

	public static void main(String[] args) {

		
		// IF문
		
		// if문은 조건식의 결과에 따라 블록 실행 여부가 결정된다. 다음은 if문의 형식과 실행 흐름을 보여준다.
		// 조건식에는 true 또는 false 값을 산출할 수 있는 연산식이나, boolean 변수가 올 수 있다.
		// 조건식이 true이면 블록을 실행하고 false이면 블록을 실행하지 않는다.
		
		/*
		 * if ( 조건식 ){
		 * 	실행문;
		 * 	실행문;
		 * ...
		 * }
		 */
		
		
		/*
		 *  if ( 조건식 )
		 *  실행문;
		 */
		
		// 중괄호 {} 블록은 여러 개의 실행문을 하나로 묶기 위해 작성된다.
		// 만약 조건식이 true가 될때 실행해야 할 문장이 하나 밖에 없다면 생략할 수 있다.
		// 하지만 중괄호 {} 블록을 생략하지 않고 작성하는 것을 추천한다.
		
		// 중괄호 블록을 작성하지 않으면 코드의 가독성 (코드 해석)이 좋지않고, 버그 발생의 원인이 될 수 있다.
		
	}

}
