package Chapter_06_01;

public class Object_03 {

	public static void main(String[] args) {

		// 객체의 상호작용
		
		// 현실 세계에서 일어나는 모든 현상은 객체와 객체 간의 상호작용으로 이루어져 있다.
		// 예를 들어 사람은 전자 계산기의 기능을 이용하고, 전자계산기는 계산 결과를 사람에게 알려주는 상호작용을 한다.
		
		// 소프트웨어에서도 마찬가지이다.
		// 객체들은 각각 독립적으로 존재하고, 다른 객체와 서로 상호작용 하면서 동작한다.
		// 객체들 사이의 상호작용 수단은 메소드이다.
		// 객체가 다른 객체의 기능을 이용하는 것이 바로 메소드 호출이다.
		
		// 메소드 호출은 다음가 같은 형태를 가지고 있다.
		// 객체에 도트(.) 연산자를 붙이고 메소드 이름을 기술하면 된다.
		// 도트 연산자는 객체의 필드와 메소드에 접근할 때 사용한다.
		
		// 매개값은 메소드를 실행하기 위해 필요한 데이터이다.
		// 예를 들어 10과 20을 주고 더하기 기능을 이용한다라고 했을 때 10과 20이 더하기 기능의 매개값이다.
		// 리턴값은 메소드가 실행하고 나서 호출한 곳으로 돌려주는 (리턴하는)값이다.
		// 다음은 자바 코드로 본 메소드 호출이다.
		
//		int result = Calculator.add(10,20);
		
		// 객체의 상호작용은 객체 간의 메소드 호출을 의미하며 매개값과 리턴값을 통해서 데이터를 주고 받는다.
		
	}

}
