package Chapter_06_01;

public class Object_02 {

	public static void main(String[] args) {

		
		// 객체란 ?
		
		// 객체(Object)란 물리적으로 존재하거나 추상적으로 생각할 수 있는 것 중에서 자신의 속성을 가지고 있고 다른 것과 식별 가능한 것을 말한다.
		// 예를 들어 물리적으로 존재하는 자동차, 자전거, 책, 사람과 추상적인 학과, 강의, 주문 등이 모두 객체가 될 수 있다.
		// 객체는 속성과 동작으로 구성되어 있다.
		// 예를 들어 사람은 이름, 나이, 등의 속성과 웃다, 걷다 등의 동작이 있고, 자동차는 색상, 모델명 등의 속성과 달린다, 멈춘다 등의 동작이 있다.
		// 자바는 이 속성과 동작들을 각각 필드(field)와 메소드(method)라고 부른다.
		
		// 현실 세계의 객체를 소프트웨어 객체로 설계하는 것을 객체 모델링(Object Modeling)이라고 한다.
		// 객체 모델링은 현실 세계 객체의 속성과 동작을 추려내어 소프트웨어 객체의 필드와 메소드로 정의하는 과정이라고 볼 수 있다.
		
		
	}

}
