package Chapter_06_02;

public class Object_and_Class_01 {

	public static void main(String[] args) {

		// 객체와 클래스
		
		// 현실에서 객체는 갑자기 하늘에서 떨어지는 것이 아니라, 설계도를 바탕으로 만들어진다.
		// 예를들어 사람들이 자동차를 이용하기 위해서는 우선 공장에서 설계도를 보고 자동차를 만들어야 한다.
		// 객체지향 프로그래밍에서도 마찬가지다.
		// 메모리에서 사용하고 싶은 객체가 있다면 우선 설계도로 해당 객체를 만드는 작업이 필요하다.
		// 자바에서는 설계도가 바로 클래스(class)이다.
		// 클래스에는 객체를 생성하기 위한 필드와 메소드가 정의되어 있다.
		// 클래스로부터 만들어진 객체를 해당 클래스의 인스턴스(instance)라고 한다.
		// 자동차 객체는 자동차 클래스의 인스턴스 인 셈이다.
		// 그리고 클래스로부터 객체를 만드는 과정을 인스턴스화라고 한다.
		// 하나의 클래스로부터 여러 개의 인스턴스를 만들 수 있는데,
		// 이것은 동일한 설계도로부터 여러 대의 자동차를 만드는 것과 동일하다.
		
		// 객체 지향 프로그래밍 개발은 세 가지 단계가 있다.
		
		// 첫 번째 단계는 클래스를 설계해야 한다.
		// 두 번째 단계는 설계된 클래스를 가지고 사용할 객체를 생성해야 한다.
		// 세 번째 단계는 생성된 객체를 이용하는 것이다.
		
		// 우리는 지금까지 많은 클래스를 만들어 보았다.
		// 사실 클래스는 객체를 만들기 위한 설계도 였지만 객체로 만들어 보지는 않았따.
		// 단순히 main() 메소드만 작성해서 실행할 목적으로 클래스를 이용했다.
		// 하지만 main() 메소드가 없는 클래스는 객체 생성 과정을 거쳐 사용해야 한다.
	}

}
